[M_GrandmotherHouse MissionDefinition]
TurnInDescription="Other titles for the group include "Grandma Knows Best," "Grandma's a Rolling Stone" and "This Jack Can't Hold You, It's Deep.".''"
MissionSummary="He went to see Jack's beautiful Syla."
